In [161]:
people = {
'first': ['Corey', 'Jane', 'John'],
'last': ['Schafer', 'Doe', 'Doe'],
'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']
}
import pandas as pd
df = pd.DataFrame(people)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [162]:
df['first'] + ' ' + df['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [163]:
df['full_name'] = df['first'] + ' ' + df['last']

In [164]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [165]:
df.drop(columns=['first', 'last'], inplace=True)

In [166]:
df

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [167]:
df['full_name'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [168]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [169]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [170]:
df._append({'first': 'Tony'}, ignore_index=True)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [171]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [172]:
people = {
'first': ['Toney', 'Steve'],
'last': ['Stark', 'Rogers'],
'email': ['IronMan@avenge.com', 'Cap@avenge.com']
}

df2 = pd.DataFrame(people)
df2

   first    last               email
0  Toney   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [173]:
df._append(df2, ignore_index=True, sort=False )

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN  Toney    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [174]:
df = df._append(df2, ignore_index=True, sort=False)

In [175]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN  Toney    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [176]:
df.drop(index=4, inplace=True)

In [177]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN  Toney    Stark

In [178]:
filt = df['last'] == 'Doe'

In [179]:
df.drop(index=df[filt].index, inplace=True)

In [180]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3       IronMan@avenge.com            NaN  Toney    Stark